БПКР/src/Documents/ОтчетПоЗакупочнымАктам/ОтчетПоЗакупочнымАктам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОтчетПоЗакупочнымАктам</name>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗакупочныйАкт</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Documents/ОтчетПоЗакупочнымАктам/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Заполнение заголовка печатной формы основного отчета
//
Процедура ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьШапка)

	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(СтруктураПараметров.Организация);
	Дата = СтруктураПараметров.Дата;	
	
	КонтактныеДанные = ПолучитьКонтактнуюИнформацию(СтруктураПараметров.Организация);
	
	Индекс           = КонтактныеДанные.Индекс;
	АдрОбластьГород  = КонтактныеДанные.АдрОбластьГород;
	ЮрАдрес	         = КонтактныеДанные.АдресОрганизации; 
	Телефон		     = КонтактныеДанные.Телефон;	
	
	ДанныеПечати = Новый Структура();
	
	ДанныеПечати.Вставить("ОрганизацияНаименованиеПолное", СведенияОбОрганизации.НаименованиеПолное);
	
	Если ЗначениеЗаполнено(АдрОбластьГород) Тогда 
		ДанныеПечати.Вставить("АдресГород", АдрОбластьГород);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЮрАдрес) Тогда 
		ДанныеПечати.Вставить("АдресУлица", ЮрАдрес);
	КонецЕсли;
	
	ДанныеПечати.Вставить("Телефон", Телефон);
	
	Если ЗначениеЗаполнено(Индекс) ТОгда	
		ДанныеПечати.Вставить("ИНД1", Сред(Индекс,1,1));
		ДанныеПечати.Вставить("ИНД2", Сред(Индекс,2,1));
		ДанныеПечати.Вставить("ИНД3", Сред(Индекс,3,1));
		ДанныеПечати.Вставить("ИНД4", Сред(Индекс,4,1));
		ДанныеПечати.Вставить("ИНД5", Сред(Индекс,5,1));
		ДанныеПечати.Вставить("ИНД6", Сред(Индекс,6,1));
	КонецЕсли;

	
	Если ЗначениеЗаполнено(СведенияОбОрганизации.ОКПО) Тогда 
		ДанныеПечати.Вставить("ОКПО1", Сред(СведенияОбОрганизации.ОКПО,1,1));
		ДанныеПечати.Вставить("ОКПО2", Сред(СведенияОбОрганизации.ОКПО,2,1));
		ДанныеПечати.Вставить("ОКПО3", Сред(СведенияОбОрганизации.ОКПО,3,1));
		ДанныеПечати.Вставить("ОКПО4", Сред(СведенияОбОрганизации.ОКПО,4,1));
		ДанныеПечати.Вставить("ОКПО5", Сред(СведенияОбОрганизации.ОКПО,5,1));
		ДанныеПечати.Вставить("ОКПО6", Сред(СведенияОбОрганизации.ОКПО,6,1));
		ДанныеПечати.Вставить("ОКПО7", Сред(СведенияОбОрганизации.ОКПО,7,1));
		ДанныеПечати.Вставить("ОКПО8", Сред(СведенияОбОрганизации.ОКПО,8,1));
	КонецЕсли;
	
	ДанныеПечати.Вставить("ИНН1", Сред(СведенияОбОрганизации.ИНН, 1, 1));
	ДанныеПечати.Вставить("ИНН2", Сред(СведенияОбОрганизации.ИНН, 2, 1));
	ДанныеПечати.Вставить("ИНН3", Сред(СведенияОбОрганизации.ИНН, 3, 1));                           
	ДанныеПечати.Вставить("ИНН4", Сред(СведенияОбОрганизации.ИНН, 4, 1));
	ДанныеПечати.Вставить("ИНН5", Сред(СведенияОбОрганизации.ИНН, 5, 1));
	ДанныеПечати.Вставить("ИНН6", Сред(СведенияОбОрганизации.ИНН, 6, 1));
	ДанныеПечати.Вставить("ИНН7", Сред(СведенияОбОрганизации.ИНН, 7, 1));
	ДанныеПечати.Вставить("ИНН8", Сред(СведенияОбОрганизации.ИНН, 8, 1));
	ДанныеПечати.Вставить("ИНН9", Сред(СведенияОбОрганизации.ИНН, 9, 1));
	ДанныеПечати.Вставить("ИНН10", Сред(СведенияОбОрганизации.ИНН, 10, 1));
	ДанныеПечати.Вставить("ИНН11", Сред(СведенияОбОрганизации.ИНН, 11, 1));
	ДанныеПечати.Вставить("ИНН12", Сред(СведенияОбОрганизации.ИНН, 12, 1));
	ДанныеПечати.Вставить("ИНН13", Сред(СведенияОбОрганизации.ИНН, 13, 1));
	ДанныеПечати.Вставить("ИНН14", Сред(СведенияОбОрганизации.ИНН, 14, 1));
	
	ДанныеПечати.Вставить("ГНСНаименование", СведенияОбОрганизации.ГНСНаименование);
	
	ДанныеПечати.Вставить("ГНС1", Сред(СведенияОбОрганизации.ГНСКод, 1, 1));
	ДанныеПечати.Вставить("ГНС2", Сред(СведенияОбОрганизации.ГНСКод, 2, 1));
	ДанныеПечати.Вставить("ГНС3", Сред(СведенияОбОрганизации.ГНСКод, 3, 1));
	
	Если Месяц(Дата) = 3 Тогда
		Квартал = 1;
	ИначеЕсли Месяц(Дата) = 6 Тогда
		Квартал = 2;
	ИначеЕсли Месяц(Дата) = 9 Тогда
		Квартал = 3;
	Иначе
		Квартал = 4;
	КонецЕсли;
	
	ДанныеПечати.Вставить("Квартал", Квартал);
	
	Год = Формат(Дата, "ДФ=гггг");
	
	ДанныеПечати.Вставить("Год1", Сред(Год, 1, 1));
	ДанныеПечати.Вставить("Год2", Сред(Год, 2, 1));
	ДанныеПечати.Вставить("Год3", Сред(Год, 3, 1));                           
	ДанныеПечати.Вставить("Год4", Сред(Год, 4, 1));
	
	ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
КонецПроцедуры

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Организации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);

	Индекс = СведенияОбОрганизации.Индекс; 
	
	ГородНасПункт   = ?(СведенияОбОрганизации.Город  = "",СведенияОбОрганизации.НаселенныйПункт,СведенияОбОрганизации.Город);
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
		+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон = СведенияОбОрганизации.Тел;
	
	Структура = Новый Структура("Индекс,АдрОбластьГород,АдресОрганизации,Телефон", Индекс,АдрОбластьГород,АдресОрганизации,Телефон);
	
	Возврат Структура;
	
КонецФункции // ПолучитьАдресОрганизации()

Функция КоличествоСтраницПриложения(Выборка)

	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоЗакупочнымАктам.ПФ_MXL_ЗакупочныйАкт_Таблица");

	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьИтоги  = Макет.ПолучитьОбласть("ИтогиТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	МассивОбластей = Новый Массив();
	МассивОбластей.Добавить(ОбластьИтоги);
	
	КоличествоСтраниц = 1;
	КоличествоСтрок = Выборка.Количество();
	НомерСтроки = 1;
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьСтрока.Параметры.Заполнить(Выборка);
		
		МассивОбластей.Добавить(ОбластьСтрока);
		
		Если КоличествоСтрок = НомерСтроки Тогда
			МассивОбластей.Добавить(ОбластьПодвал);	
		КонецЕсли;	
		
		Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
			КоличествоСтраниц = КоличествоСтраниц + 1;
			
			ТабличныйДокумент.Вывести(ОбластьИтоги);
			
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			
			ТабличныйДокумент.Вывести(ОбластьШапка);
		КонецЕсли;	
		
		Если КоличествоСтрок = НомерСтроки Тогда
			Прервать;	
		КонецЕсли;
		
		ТабличныйДокумент.Вывести(ОбластьСтрока);
		
		МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;	
	
	Возврат КоличествоСтраниц;
КонецФункции // ПроверитьКоличествоЛистов()

#КонецОбласти

#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
//@skip-warning
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой НДС
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьЗакупочногоАкта(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоЗакупочнымАктам.Ссылка КАК Ссылка,
		|	ОтчетПоЗакупочнымАктам.Дата КАК Дата,
		|	ОтчетПоЗакупочнымАктам.Организация КАК Организация,
		|	ОтчетПоЗакупочнымАктам.Контрагент КАК УГНС,
		|	ОтчетПоЗакупочнымАктам.Количество КАК КоличествоЗакупочныхАктов,
		|	ОтчетПоЗакупочнымАктам.СуммаДокумента КАК СуммаПриобретенныхТоваров,
		|	ОтчетПоЗакупочнымАктам.ЗакупочныйАкт.(
		|		НомерСтроки КАК НомерСтроки,
		|		Дата КАК Дата,
		|		Номер КАК Номер,
		|		Контрагент.Представление КАК КонтрагентНаименование,
		|		Товар.Представление КАК НоменклатураПредставление,
		|		Количество КАК Количество,
		|		Сумма КАК Сумма,
		|		Контрагент.ИНН КАК КонтрагентИНН,
		|		Товар.КодТНВЭД КАК ТоварКодТНВЭД
		|	) КАК ЗакупочныйАкт
		|ИЗ
		|	Документ.ОтчетПоЗакупочнымАктам КАК ОтчетПоЗакупочнымАктам
		|ГДЕ
		|	ОтчетПоЗакупочнымАктам.Ссылка В (&МассивОбъектов)";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоЗакупочнымАктам_ЗакупочныйАкт";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоЗакупочнымАктам.ПФ_MXL_ЗакупочныйАкт");
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
	
		СтруктураПараметров = Новый Структура;
		СтруктураПараметров.Вставить("Организация", Шапка.Организация);
		СтруктураПараметров.Вставить("Дата", 		Шапка.Дата);
		
		ЗаполнитьШапкуОтчета(СтруктураПараметров, ОбластьШапка);	
		
		ДанныеПечати = Новый Структура();
		
		ДанныеПечати.Вставить("Ячейка203", Шапка.КоличествоЗакупочныхАктов);
		ДанныеПечати.Вставить("Ячейка204", Шапка.СуммаПриобретенныхТоваров);
		
		ОбластьШапка.Параметры.Ячейка203 = Шапка.КоличествоЗакупочныхАктов;
		ОбластьШапка.Параметры.Ячейка204 = Шапка.СуммаПриобретенныхТоваров;	
		
		ВыборкаЗакупочныйАкт = Шапка.ЗакупочныйАкт.Выбрать();
		КоличествоСтраниц = КоличествоСтраницПриложения(ВыборкаЗакупочныйАкт);
		
		КоличествоСтраницСтрокой = Формат(КоличествоСтраниц, "ЧГ=0");
		
		Если КоличествоСтраниц > 99 Тогда
			ДанныеПечати.Вставить("Лист1", Сред(КоличествоСтраницСтрокой, 1, 1));
			ДанныеПечати.Вставить("Лист2", Сред(КоличествоСтраницСтрокой, 2, 1));
			ДанныеПечати.Вставить("Лист3", Сред(КоличествоСтраницСтрокой, 3, 1));
			
		ИначеЕсли КоличествоСтраниц > 9 Тогда
			ДанныеПечати.Вставить("Лист2", Сред(КоличествоСтраницСтрокой, 1, 1));
			ДанныеПечати.Вставить("Лист3", Сред(КоличествоСтраницСтрокой, 2, 1));
			
		Иначе
			ДанныеПечати.Вставить("Лист3", Сред(КоличествоСтраницСтрокой, 1, 1));
		КонецЕсли;
		
		ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НДС
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ПечатьЗакупочногоАктаПриложение(МассивОбъектов, ОбъектыПечати)	
	
	Запрос = Новый Запрос;		
	Запрос.Текст =	
		"ВЫБРАТЬ
		|	ОтчетПоЗакупочнымАктам.Ссылка КАК Ссылка,
		|	ОтчетПоЗакупочнымАктам.ЗакупочныйАкт.(
		|		НомерСтроки КАК НомерСтроки,
		|		Дата КАК Дата,
		|		Номер КАК Номер,
		|		Контрагент.Представление КАК КонтрагентНаименование,
		|		Товар.Представление КАК НоменклатураПредставление,
		|		Количество КАК Количество,
		|		Сумма КАК Сумма,
		|		Контрагент.ИНН КАК КонтрагентИНН,
		|		Товар.КодТНВЭД.Код КАК ТНВЭД
		|	) КАК ЗакупочныйАкт
		|ИЗ
		|	Документ.ОтчетПоЗакупочнымАктам КАК ОтчетПоЗакупочнымАктам
		|ГДЕ
		|	ОтчетПоЗакупочнымАктам.Ссылка В(&МассивОбъектов)
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки";	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Шапка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоЗакупочнымАктам_ЗакупочныйАктПриложение";
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ОтчетПоЗакупочнымАктам.ПФ_MXL_ЗакупочныйАкт_Таблица");
	ОбластьШапка  = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ОбластьСтрока = Макет.ПолучитьОбласть("СтрокаТаблицы");
	ОбластьИтоги  = Макет.ПолучитьОбласть("ИтогиТаблицы");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");

	Пока Шапка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеПечати = Новый Структура();
		ДанныеПечати.Вставить("НомерЛиста1", "");
		ДанныеПечати.Вставить("НомерЛиста2", "");
		ДанныеПечати.Вставить("НомерЛиста3", "");
		
		ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
		
		ТабличныйДокумент.Вывести(ОбластьШапка);
		
		ВыборкаЗакупочныйАкт = Шапка.ЗакупочныйАкт.Выбрать();
		
		ДанныеПечати.Вставить("Дата1", "");
		ДанныеПечати.Вставить("Дата2", "");
		ДанныеПечати.Вставить("Дата3", "");
		ДанныеПечати.Вставить("Дата4", "");
		ДанныеПечати.Вставить("Дата5", "");
		ДанныеПечати.Вставить("Дата6", "");
		ДанныеПечати.Вставить("Дата7", "");
		ДанныеПечати.Вставить("Дата8", "");
		
		ДанныеПечати.Вставить("ИНН1", "");
		ДанныеПечати.Вставить("ИНН2", "");
		ДанныеПечати.Вставить("ИНН3", "");
		ДанныеПечати.Вставить("ИНН4", "");
		ДанныеПечати.Вставить("ИНН5", "");
		ДанныеПечати.Вставить("ИНН6", "");
		ДанныеПечати.Вставить("ИНН7", "");
		ДанныеПечати.Вставить("ИНН8", "");
		ДанныеПечати.Вставить("ИНН9", "");
		ДанныеПечати.Вставить("ИНН10", "");
		ДанныеПечати.Вставить("ИНН11", "");
		ДанныеПечати.Вставить("ИНН12", "");
		ДанныеПечати.Вставить("ИНН13", "");
		ДанныеПечати.Вставить("ИНН14", "");
		
		ДанныеПечати.Вставить("ТНВЭД1", "");
		ДанныеПечати.Вставить("ТНВЭД2", "");
		ДанныеПечати.Вставить("ТНВЭД3", "");
		ДанныеПечати.Вставить("ТНВЭД4", "");
		ДанныеПечати.Вставить("ТНВЭД5", "");
		ДанныеПечати.Вставить("ТНВЭД6", "");
		ДанныеПечати.Вставить("ТНВЭД7", "");
		ДанныеПечати.Вставить("ТНВЭД8", "");
		ДанныеПечати.Вставить("ТНВЭД9", "");
		ДанныеПечати.Вставить("ТНВЭД10", "");
		ДанныеПечати.Вставить("ТНВЭД11", "");
		ДанныеПечати.Вставить("ТНВЭД12", "");
		
		ДанныеПечати.Вставить("ВсегоКоличество", 0);
		ДанныеПечати.Вставить("ВсегоСумма", 	 0);
		
		МассивОбластей = Новый Массив();
		МассивОбластей.Добавить(ОбластьИтоги);
		
		НомерСтраницы = 1;
		КоличествоСтрок = ВыборкаЗакупочныйАкт.Количество();
		НомерСтроки = 1;
		
		Пока ВыборкаЗакупочныйАкт.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(ВыборкаЗакупочныйАкт);
			
			Дата = Формат(ВыборкаЗакупочныйАкт.Дата, "ДФ=dd.MM.yyyy; ДЛФ=D");
			
			ДанныеПечати.Дата1 = Сред(Дата, 1, 1);	
			ДанныеПечати.Дата2 = Сред(Дата, 2, 1);	
			ДанныеПечати.Дата3 = Сред(Дата, 4, 1);	
			ДанныеПечати.Дата4 = Сред(Дата, 5, 1);	
			ДанныеПечати.Дата5 = Сред(Дата, 7, 1);	
			ДанныеПечати.Дата6 = Сред(Дата, 8, 1);	
			ДанныеПечати.Дата7 = Сред(Дата, 9, 1);	
			ДанныеПечати.Дата8 = Сред(Дата, 10, 1);
			
			ДанныеПечати.ИНН1 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 1, 1);
			ДанныеПечати.ИНН2 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 2, 1);
			ДанныеПечати.ИНН3 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 3, 1);                           
			ДанныеПечати.ИНН4 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 4, 1);
			ДанныеПечати.ИНН5 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 5, 1);
			ДанныеПечати.ИНН6 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 6, 1);
			ДанныеПечати.ИНН7 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 7, 1);
			ДанныеПечати.ИНН8 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 8, 1);
			ДанныеПечати.ИНН9 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 9, 1);
			ДанныеПечати.ИНН10 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 10, 1);
			ДанныеПечати.ИНН11 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 11, 1);
			ДанныеПечати.ИНН12 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 12, 1);
			ДанныеПечати.ИНН13 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 13, 1);
			ДанныеПечати.ИНН14 = Сред(ВыборкаЗакупочныйАкт.КонтрагентИНН, 14, 1);
			
			ДанныеПечати.ТНВЭД1 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 1, 1);
			ДанныеПечати.ТНВЭД2 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 2, 1);
			ДанныеПечати.ТНВЭД3 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 3, 1);                           
			ДанныеПечати.ТНВЭД4 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 4, 1);
			ДанныеПечати.ТНВЭД5 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 5, 1);
			ДанныеПечати.ТНВЭД6 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 6, 1);
			ДанныеПечати.ТНВЭД7 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 7, 1);
			ДанныеПечати.ТНВЭД8 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 8, 1);
			ДанныеПечати.ТНВЭД9 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 9, 1);
			ДанныеПечати.ТНВЭД10 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 10, 1);
			ДанныеПечати.ТНВЭД11 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 11, 1);
			ДанныеПечати.ТНВЭД12 = Сред(ВыборкаЗакупочныйАкт.ТНВЭД, 12, 1);
			
			ОбластьСтрока.Параметры.Заполнить(ДанныеПечати);
			
			МассивОбластей.Добавить(ОбластьСтрока);
			
			Если КоличествоСтрок = НомерСтроки Тогда
				МассивОбластей.Добавить(ОбластьПодвал);	
			КонецЕсли;	
			
			Если НЕ ТабличныйДокумент.ПроверитьВывод(МассивОбластей) Тогда
				НомерСтраницы = НомерСтраницы + 1;
				
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьИтоги);
				
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				
				Номер = Формат(НомерСтраницы, "ЧГ=0");
				
				Если НомерСтраницы > 99 Тогда
					ДанныеПечати.НомерЛиста1 = Сред(Номер, 1, 1);
					ДанныеПечати.НомерЛиста2 = Сред(Номер, 2, 1);
					ДанныеПечати.НомерЛиста3 = Сред(Номер, 3, 1);
					
				ИначеЕсли НомерСтраницы > 9 Тогда
					ДанныеПечати.НомерЛиста1 = "";
					ДанныеПечати.НомерЛиста2 = Сред(Номер, 1, 1);
					ДанныеПечати.НомерЛиста3 = Сред(Номер, 2, 1);
					
				Иначе
					ДанныеПечати.НомерЛиста1 = "";
					ДанныеПечати.НомерЛиста2 = "";
					ДанныеПечати.НомерЛиста3 = Сред(Номер, 1, 1);
				КонецЕсли;	
				
				ОбластьШапка.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьШапка);
				
				ДанныеПечати.ВсегоКоличество = 0;
				ДанныеПечати.ВсегоСумма 	 = 0;
			КонецЕсли;	
			
			ДанныеПечати.ВсегоКоличество = ДанныеПечати.ВсегоКоличество + ВыборкаЗакупочныйАкт.Количество;
			ДанныеПечати.ВсегоСумма 	 = ДанныеПечати.ВсегоСумма + ВыборкаЗакупочныйАкт.Сумма;
			
			Если КоличествоСтрок = НомерСтроки Тогда
				ТабличныйДокумент.Вывести(ОбластьСтрока);
				
				ОбластьИтоги.Параметры.Заполнить(ДанныеПечати);
				ТабличныйДокумент.Вывести(ОбластьИтоги);
				
				ТабличныйДокумент.Вывести(ОбластьПодвал);
				
				Прервать;	
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьСтрока);
			
			МассивОбластей.Удалить(МассивОбластей.Количество() - 1);
			НомерСтроки = НомерСтроки + 1;	
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗакупочныйАкт") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ЗакупочныйАкт", 
		НСтр("ru = 'Закупочный акт'"), 
		ПечатьЗакупочногоАкта(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНДС.ПФ_MXL_ЗакупочныйАкт");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗакупочныйАктПриложение") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"ЗакупочныйАктПриложение", 
		НСтр("ru = 'Закупочный акт приложение'"), 
		ПечатьЗакупочногоАктаПриложение(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.ОтчетПоНДС.ПФ_MXL_ЗакупочныйАкт_Таблица");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗакупочныйАкт,ЗакупочныйАктПриложение";
	КомандаПечати.Представление = НСтр("ru = 'Закупочный акт'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Обработчик = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.Порядок = 1;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
